import pandas as pd 

path = "C:\\Users\\hsung\\OneDrive\\바탕 화면\\팀플 데이터\\전월세\\6years_data.csv"
years_data = pd.read_csv(path, encoding='utf-8', index_col = 0)

#===============================================================================================
#===============================================================================================
# 자치구명 데이터 할당
자치구명 = ['강남구','강동구','강북구','강서구','관악구','광진구','구로구','금천구','노원구',\
           '도봉구','동대문구','동작구','마포구','서대문구','서초구','성동구','성북구','송파구',\
           '양천구','영등포구','용산구','은평구','종로구','중구','중랑구']
# 구별데이터 = {}
# for gu in 자치구명:
#     gu_rows = years_data['자치구명'] == gu
#     구별데이터[gu] = years_data[gu_rows]
    
#===============================================================================================
#===============================================================================================
# 전세 / 월세 데이터 할당
전월세 = ['전세','월세']
# 전월세별데이터 = {}     
# for gu in 자치구명:
#     전월세별데이터[gu] = {}
#     for 전월 in 전월세:
#         data_filter_row = (years_data['자치구명'] == gu) & (years_data['전월세구분'] == 전월)
#         # print(data_filter_row)
#         전월세별데이터[gu][전월] = years_data[data_filter_row]
        
# print(set(전월세별데이터["강동구"]["월세"]['건물용도'])) 
# print(전월세별데이터["강동구"]["전세"][:5])

#===============================================================================================
#===============================================================================================
# '오피스텔', '연립다세대', '아파트', '단독다가구' 별 데이터 할당
건물유형 = ['오피스텔', '연립다세대', '아파트', '단독다가구']
총데이터 = {}
for gu in 자치구명:
    총데이터[gu] = {}
    for 전월 in 전월세:
        총데이터[gu][전월] = {}
        for 유형 in 건물유형:
            data_filter_row = (years_data['자치구명'] == gu) & (years_data['전월세구분'] == 전월) & (years_data['건물용도'] == 유형)
            총데이터[gu][전월][유형] = years_data[data_filter_row]

print(총데이터["영등포구"]["월세"]["아파트"])